{
    "HDA": [
        {
            "timeSpent": "6 Months",
            "description": "Had the best time of my life. It was so nice being able to experience university life in a different country. Hochschule Darmstadt has a gorgeous modern campus with lots of nice food and events happening all of the time. My favourite event was the free festival they hold during the summer every year. The location is also great with Frankfurt being only 20 minutes away if youre interested in the hustle and bustle of a big city. Darmstadt is definitely a student city with lots of pubs and clubs across the city."
        },
        {
            "timeSpent": "5 Months",
            "description": "The student accomodation was easy enough to find. I stayed in the Berliner Allee complex and paid 420 per month with bills included. The apartments are only 5 minutes walking distance away from the University. The university put in a lot of work to run social events to help us make friends with other international students. It felt like there was always something to do. Luckily I only had classes 3 days a week which meant I had more time to have fun and explore."
        },
        {
            "timeSpent": "5 and a half months",
            "description": "I really enjoyed my time living here. The university had a lot of module options to choose from and you were permitted to move classes if you didn't like your modules. Some of my classes were quite tough and the passing mark varied between classes. I didn't realise they had a different grading system and testing rules so I was caught off when I realised the passing mark is 50%. For many exams you were allowed to bring a sheet of notes in with you too whic is very different from Ireland I found. The social aspects were amazing. Darmstadt is a big city but is heavily connected so it is very easy to get around"
        },
        {
            "timeSpent": "6 Months",
            "description": "My favourite part was the location of the city. H-DA set you up with a German student card. This means that all of your transport is free across the Hessen region. I was low-key broke when I moved away for Erasmus but I could still travel and see a lot of Germany for free with this travel pass. If you go for the summer semester just be aware of how hot this place can get. The south of Germany is no joke and temperatures were often above 35 degrees which i struggled to cope with at times."
        }
    ],
    "WINDESHEIM": [
        {
            "timeSpent": "7 Months",
            "description": "The area around Zwolle is especially beautiful. I would definitely recommend to explore the surroundings by bike and by boat. You can go to the north of the Veluwe, bike alongside the IJssel river, cycle in the area around Dalfsen/Ommen. You can go wakeboarding or waterskiing on the Wijthmenerplas at Lakeside Cablepark. They have a nice terrace there with Restaurant as well. The Tulip fields are beautiful if you go in Summer."
        },
        {
            "timeSpent": "5 months",
            "description": "My time at Windesheim was truly remarkable. The professors were incredibly supportive and adept at catering to various learning styles, which I particularly appreciated during my Erasmus program. The diverse approaches to studying enhanced my academic journey immensely. . The facilities are great and the teachers are mostly good. I've you have questions they are eager to help. It can be crowded sometimes. Then it's hard to find a quiet place to study, but most of the times you can find a place with good internet and electricity to hook up your laptop."
        },
        {
            "timeSpent": "6 Months",
            "description": "I loved my time living here. There was always somthing to do and it felt like a busy student city. I would sometimes go up to Amsterdam as it was only an hour away by Train. The other Erasmus students were lovely and we would do a lot of sports and activity together. The only downside was that the accomodation is done based on a lottery style allocation so although I got lucky with a room, I have friends who were stuck looking for accomodation without help from the uni"
        }
    ],
    "OAMK": [
        {
            "timeSpent": "9 months",
            "description": "Oulo is a good choice if youre like me and prefer to travel and discover the nature and by going in Oulu you can be sure that everyone share this interest. I was lucky enough to see the Northern Lights during my stay here. There is also a nice beach called Nallikari. I got on fine speaking just English and found I did not need to learn any other languages. My favourite club for goign out was called Karlee"
        },
        {
            "timeSpent": "4 months",
            "description": "Oulo may not be the best option if you are on a tight budget. Its quite an expensive city to live in Very similar to Dublin. Despite this, I enjoyed my Erasmus experience so much. I think you really should be able to appreciate the nature and climate of Finland. You shouldn't go to Oulu for the parties, although they can be fun! Make trips and try get out of Oulu during the weekend, otherwise you will get easily bored. There are weekly student organised parties. Best parties for me were in the psoas bindings or student houses"
        },
        {
            "timeSpent": "6 Months",
            "description": "The student life is great. The city has a lot of universities. In the University of Oulu there are a lot of international students. There are also several attentive organisations for them (ESN y NISO). You can find all kinds of activities, from parties to language groups, trips and sports. I think it is important to know some of the language. It will give you a wider view on what it is like to live there. It will give you the opportunity to know the culture better and involve yourself/ integrate yourself more into the place. Take full advantage of it. You are going to come across many challenges and not everything will be easy, but that is the fun of it. Without those things it wouldn't be interesting."
        }
    ],
    "OTH": [
        {
            "timeSpent": "4 Months",
            "description": "Although many people were put off by going to Regensburg because it was in Bavaria and that meant learning Bayerisch, this was actually one of the things that attracted me to the area and added an exciting element to developing my Germanic skills. I was in Regensburg for the summer semester and the actual semester lasts 3 months, but you attend a one-month induction course before you start classes. This course tells you about everything from subscribing to courses to telling you about the transport system in the city and helping you open bank accounts. rent in all of the halls is very reasonable and nobody's rent exceeded 260 euros as far as I was aware."
        },
        {
            "timeSpent": "5 Months",
            "description": "The student lifestyle is absolutely amazing and I would do it all again in a heartbeat if I could. During the day when you are not at University you can chill out in a biergarten on the river, or in one of the many cafes in town, or if the weather is nice (which it mostly is) there are loads of parks to sunbathe in. Or Westbad is an open air swimming pool with lots of grassy areas to lie out on and work on your tan. One of our favourite hangouts was a bar called Strandbar and this was a bar on the river, which they had made to look like an actual beach - sand, deckchairs, volleyball court, the lot! The best thing about this bar was that it was a happy hour from 12-6 every day.\n\nThe nightlife in Regensburg is amazing. Nothing is too expensive, everything is within walking distance and clubs are always busy, you can more or less pick a club and it's guaranteed to be buzzing.\n\nThe German students studying in Regensburg are also incredible - really friendly and always eager to offer to do things with you or recommend places to go and things to see."
        },
        {
            "timeSpent": "4 Months",
            "description": " I would highly recommend trying some German dishes as most German restaurants serve speciality Bavarian food, which you can only get in that part of Bavaria. Sometimes it's a bit of a guess when you are looking through the menu, but everything that we tried we loved. Accommodation prices were actually very reasonable - between 150 euros - 250 euros as far as I was aware. If you like electro then Suite 15 is the place to go! Suite also has a separate space that plays 60s music on a Thursday night, which is always good for a sing-along.\n\nZapzaparia is really good if you want a good dance and cheap tequila.\n\nGloria is a converted cinema so is huge! The last Saturday of every month they play 90's music and that's definitely worth a visit. If you want to go to a bar, Regensburg has more bars per square mile than any other city in Germany"
        }
    ],
    "MDU": [
        {
            "timeSpent": "5 Months",
            "description": "The atmosphere is friendly and there is a student association (international committee) that bases themselves on hospitality and organising activities, trips and excursions. I would recommend it to those who, like me, are studying in the department of technology in which Mälardalen University is very well connected with multinational automation, transport, defence and automobiles. Therefore the opportunities to grow and/or work are very frequent. Even if the city itself isn't the most exciting, the atmosphere is definitely very welcoming and the the buildings are all covered in greenery."
        },
        {
            "timeSpent": "5 Months",
            "description": "In the city centre there a few different clubs and pubs. Each plays its own different genre of music and has their own students offers on certain days of the weeks, at particular times.\n\nHowever in the context of Erasmus, you cannot forget the so-called \"pre-party\" that take place in the common rooms of student residences. There it is possible to socialise with other students and warm up for the night ahead. Close to the lake, beyond the train station, there are some bars that offer a buffet at the reasonable price of (€10) and on Friday afternoons, Blue Moon Bar and Sky Bar offer a really convenient buffet, where you pay only for an appetiser or an alcoholic beverage and then you can eat as much as you like from the buffet. Buy a bike (you can find one for €30-€50).\n\nParticipate as much as you can in any of the activities that are organised: pre-party, tours, Ice-skating, cruises, buffets, sports, excursions. The more that you participate, the more friends you will make and the more your Erasmus year all be an unforgettable experience!"
        },
        {
            "timeSpent": "4 Months",
            "description": "The city itself is located close to the lake Mälaren. The city is a mix of new modern buildings as well as older buildings, surrounding the stream called svartån. You have guaranteed accommodation through the school. I would recommend going to Löga beach, Kokpunkten (action bathhouse), Bellevue (Sportscenter), Walking around the city center, Erikslund shopping mall. There is not a lot of nightclubs in Västerås, although there are Royale and Publik which are the two bigger ones. join a student organization! The student organizations at MDH are throwing parties and events every month and is the best way to experience student life in Västerås. I can especially recommend the organization IMF-föreningen (imf-foreningen.se) for all of you that are studying economics or marketing."
        }
    ],
    "FHNW": [
        {
            "timeSpent": "5 Months",
            "description": "I would recommend to visit the lake, Bahnofstarasse and nearby areas. For those who are interested in clubbing, Hive would be my recommendation. And there are quite a few places for hiking as well around the city such as Richterswil. Zurich by night is perfect for making party because so mamy interesting club and friendly people in the clubs. Zurich by day is different working with full of energy that we recharged from weekend by after Hour by dancing with electronic sounds. High stardard of living."
        },
        {
            "timeSpent": "5 Months",
            "description": "Education in Switzerland is one of the best of the world. Lifestyle is study and working or study and enjoy circumstand for example now summer go swimming or do activities at the Zurich lake side walk to river in the middle if city sit in cafe shop beside the river drink tea\nand enjoy to watch the peopke walk around or talk with the Swiss people actuelly they are respected to all people. there are many good club, for me Lambada club at Langstreet , 8004 Zurich is exciting club ever you can find every international people and every kind of Gender there."
        }
    ],
    "UIA": [
        {
            "timeSpent": "4 Months",
            "description": "Is a really small town. The university has Advanced facilities, frequent student-teacher interactions and quality teaching methods by renowned professors make this University one of the best places to study in Norway. It’s very homely, everyone knows each other, but it’s not ideal if you like to go on nights out. There is only one bar and the nightlife is quite pitiful.  the university has a very good system for allocating accommodation to Erasmus students."
        },
        {
            "timeSpent": "5 Months",
            "description": "The city is the optimal summer city in Norway - with the beautiful coastline, the warm and sunny wether, popular festivals and Scandinavia's biggest beach party (Palmesus).  Eating out in Norway is really expensive, but if you have the possibility you should try out Mother India - Norway's best Indian restaurant(! ) and Food Asylum, with sushi as you never have seen or tasted it before - amazing!"
        },
        {
            "timeSpent": "5 Months",
            "description": "ESN was in charge of our cultural trips, party and drinking culture which was even more possible with the participation of all our international friends, especially Americans, that often decided to organize “Tip the Cup” leagues. As you can imagine mornings where so hard! Party was only a part of the experience. On the other hand everyone was amazed by Norways nature so hiking and trips to the mountain were an important part of our day a day survival (Norway is not known as a very cheap country especially for drinking). During the semesters every country was able to present itself in an International Pub and twice in the year we enjoyed a multicultural potluck dinner were we tasted food from many countries"
        }
    ],
    "FH": [
        {
            "timeSpent": "5 Months",
            "description": "Due to the fact of being a small town all the Erasmus students knew each other and we made really good friends. The uni is new and has a good library and rooms. For nights out, Segabar on karaoke nights, Kufa when they organise a party, Zur Weinschenke if you want to meet nice austrian people an grab a beer and Pure if you want a drink something and chill out."
        },
        {
            "timeSpent": "4 Months",
            "description": "Definitely think it would be helpful to know some Germany before coming here. I needed to take courses when I arrived because many locals dont speak English in supermarkets. The university is very very small, it has only about 800 students, but this is good because you get to know everybody easily.  It's a very good place to travell because it's in the middle of Europe, one hour from big cities like Munich and Innsbruck and one hour and one half from Salzburg. Italy, Switzerland and the Cezch Republic are also near. Second, people in Kufstein are very nice. In the school you have to work, but it's easy going, it's much easier than others schools and we have a lot of free time"
        }
    ],
    "RIT": [
        {
            "timeSpent": "5 Months",
            "description": "it's very centralized and you always meet people you know on the street, it's a very friendly athmosphere that i didn't encounter in big cities like Madrid or Paris. Concerning the Uni, you have everything you need, and an amazing \"Menza\" where you can eat for few cents.The city is full of high quality restaurants, museums, schools and more. It offers a variety of clubs, coffee shops, shopping malls etc but is quite affordable. Food and drinks are cheap as well as clothing stores, but clubs can be a little expensive. In Zagreb you can either find two types of clubs: clubs with regional music called “Narodna Glazba” and clubs with foreign music.\n\nI recommend : h20, ritz for national music and Opera, johann frank for foreign music. Socol club is mix of both"
        },
        {
            "timeSpent": "4 Months",
            "description": "I recommend to eat in a students restaurants, because they are incredibly cheap (lunch is around 1.5 euros). It is a city that you should visit, a lot of people speak English, food is great and don't be afraid cause both the city and people are peaceful. The whole country is tourist-oriented. Get a zet(transport company) monthly card to use the trams and busses, they go everywhere. Use cammeo taxi app, it's cheaper then Uber or any other taxi.  What's more, you can visit a lot of countries from here, like Serbia, Bosnia, Slovenia, Hungary, which are only a stone throw away."
        },
        {
            "timeSpent": "5 months",
            "description": "I sincerely think that the city, as well as the university, are really worth coming to. I'm satisfied, the professors and international relations offices look after the students pretty well. There are loads of cheap places for food, I'd recommend: Nokturno. There are also a lot of pizzerias, kebab shops and other cheap fast food places."
        }
    ],
    "UNILJ": [
        {
            "timeSpent": "4 Months",
            "description": "It is very green and lovely, not too loud or too noisy. People are kind and speak good english, they also like to help if you get lost. It is beautiful city, not too big but you have a lot to see. Very good food everywhere. I recomend it 100%. There are many pubs, caffes and clubs for students. Easy to get a student job there as well. It is easy to travel around the city with LPP ticket. Ljubljana was my first choise because it's a small european capital (compared to other european city) but it's rich of culture, good universities, the landscape is really impressive, the parties are awesome and you can easier know lots of people because of the city's dimension. In Ljubljana I have lots of free time, so I can hang out with my friends for take a coffee, hike all around the country (Slovenia is fairly small, so you can quickly go anywhere with the public transport or with a rent car, which is the better solution because the prices here are quite low and if you are a student you have some discounts) and, of course, have some nice low budget parties."
        },
        {
            "timeSpent": "5 Months",
            "description": "Slovene language is really difficult for me, but literally everyone here knows English, so you can easily stay here without have a knowledge of the local language. For going out, I recommend Kino Šiška for good rock, alternative music Metelkova and Rog for alternative partying and K4 for good electronic parties. As an international student you also obtain student coupons for food, that means that your food is partly financed from Slovenia, so you pay less for food; starting from 2,5 € until 4,47 € for a meal in certain restaurants."
        },
        {
            "timeSpent": "5 Months",
            "description": "I would say that the student lifestyle in Ljubljana is very picturesque. There are many parties and many places to go. Although Ljubljana is quite a small place, it offers many bars/night clubs where you can have fun and meet people. Ljubljana is always full of people, from those who live there permanently and those who only come to study for a year or sometimes less. The prices of drinks and entry to night clubs are not very high either. For example the entry ticket for the most expensive night club will cost you between 5 and 10 euros.\n\nFor those who don't party much, there are also many things you can do and enjoy, such as parks, swimming pools, student groups or organizations for sports or gym, galleries, exhibitions, theatre, cinema, shopping centers and many other things. living in a flat with all expenses included will cost you about 300 euros. Ljubljana has some very typical places to go out and have fun. Some of them are: Compañeros club, TOP, Circus, Parlament, Skelet bar"
        }
    ],
    "UNIZA": [
        {
            "timeSpent": "4 Months",
            "description": " the trains are for free in this country for students. Of course the nature is so beautiful and especially the mountains. Slovakia is in the middle of Europe so you reach others countries for not so high prices. There many clubs in the city center. Pubs in center and near dormitory. Many activities: basketball, volleyball, table tennis, tennis, gym for everything 8 euros per semester. ESN guys organizing a many event during the week so there will be no time for sleep. You won't get bored here. there is a language course at the university. You will learn here the basics to \"survive\". The university looks new and it is nice campus. The dormitory are little bit old but still good. The university has some really good teachers and experts in their discipline."
        }
    ],
    "UNIPG": [
        {
            "timeSpent": "4 Months",
            "description": "To being, it is important that you can speak Italian before moving here. I was studying before my arrival so it was not hard for my to become fluent.   If you like nightclubs, there are several: Cantiere, Vanilla, Urban (commercial music), 110 (rock). If you come to Perugia you cannot not go out for pizza in La Romántica (probably the best that I have ever had in my life).  It perfectly combines the atmosphere created by all the students that live there, and the cultural ambiance that emits the history and the art of each one of its buildings."
        },
        {
            "timeSpent": "5 Months",
            "description": "there is a lot of nightlife. There are tons of halls, pubs, bars and clubs, with many different styles so you can go out any day of the week. And if not, there is always La Piazza.\n\nThe only downside that there could be, if I had to put one, is that the majority of clubs are a little bit further away from the centre, which means it takes a while to get there, but all of the clubs have a free bus service that takes you right to their door.\n\nThe clubs with the biggest Erasmus atmosphere are Cantiere 21, Velvet, and Urban. Also the pub Luna Bar Ferrari on the street Corso Vannucci is always rammed with people. If you like rock (like I do), you cannot forget the Mercoledi Rock, every Wednesday at 100dieci, I really recommend it!\n\nAnd how could I not mention, the Piazza IV Novembre, the meeting point any day of the year in Perugia. Whenever it may be, you will always find the stairs in front of the fountain bustling with people drinking beer."
        },
        {
            "timeSpent": "4 Months",
            "description": "Without any room for doubt, the most economic way to travel round Italy or to take part in excursions that go and come back in one day, is the Flixbus. This is the low cost bus company that goes anywhere in Europe, allowing you to go on trips for up to €3. It is an historical town very sophisticated full of arts,culture and mysticism. The university is a little chaotic but as with the country in general it takes a bit of time to get used to the classes in Italian, etc. The teachers give you lots of help to pass the exams. The food is so tasty: pizza, pasta, Italian ice-cream… Also, at Mensa you can get a plate of pasta, rice or mash/soup, an accompaniment (green beans, potatoes, broccoli…), yoghurt of fruit, bread and a drink for 2 euros which is really good, so I’d recommend getting the card as soon as you arrive."
        }
    ],
    "UPC": [
        {
            "timeSpent": "5 Months",
            "description": "My favourite bars included Wonderbar and No T’hi Fxis are two great bars to get drunk cheap (a spirit and mixer is €5) and next to the clubs on Aribau street.\nThe Irish pub Dúblins has good beer (it has Guinness) at affordable prices.\nPippermint is also good to get drunk before heading over to the Aribau area. There was always stuff to do. Thursdays are the best day to party as it’s the day all university students go out.  You will be very tired much of the time and will sleep like a baby at night. But this is precisely because you are so busy living a great life. Check out all of Gaudi's work, it is worth any cost and is basic for understanding the rich Catalan culture"
        },
        {
            "timeSpent": "4 Months",
            "description": "Most classes are in Spanish so its required you know some Spanish before coming here. The university does offer free courses but its best if you learn some before you come. I was impressed by the professors’ approachability and knowledge from the first day of classes. They were continuously ready to do an amazing job to guarantee that their understudies figured out the material and were fruitful in their examinations."
        }
    ]
}